# Height Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ImageInstance..::..Height Property
ImageInstance Class See Also
---
The height of the ImageInstance.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020
# Syntax
C#
---
```text
public double Height { get; set; }
```

Visual Basic
---
```text
Public Property Height As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Height {
	double get ();
	void set (double value);
}
```

# Remarks
If LockProportions is true, then changes to the Height will also result in changes to the Width.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The given value for height results in a width that is more than 30000 feet because LockProportions is set to true. |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for height must be between 0 and 30000 feet. |

# See Also
ImageInstance Class
Autodesk.Revit.DB Namespace